package com.miaow.springbot;

import com.alibaba.fastjson2.JSON;
import com.miaow.pojo.weather.WeatherInfo;
import com.miaow.service.WeatherService;
import org.junit.jupiter.api.Test;

public class JSONToBeanTest {
    @Test
    void parseJson() {
        WeatherService service = new WeatherService();
        String json = "{\n" +
                "    \"message\": \"success感谢又拍云(upyun.com)提供CDN赞助\",\n" +
                "    \"status\": 200,\n" +
                "    \"date\": \"20240108\",\n" +
                "    \"time\": \"2024-01-08 22:29:14\",\n" +
                "    \"cityInfo\": {\n" +
                "        \"city\": \"常德市\",\n" +
                "        \"citykey\": \"101250601\",\n" +
                "        \"parent\": \"湖南\",\n" +
                "        \"updateTime\": \"19:46\"\n" +
                "    },\n" +
                "    \"data\": {\n" +
                "        \"shidu\": \"72%\",\n" +
                "        \"pm25\": 87,\n" +
                "        \"pm10\": 127,\n" +
                "        \"quality\": \"轻度\",\n" +
                "        \"wendu\": \"5\",\n" +
                "        \"ganmao\": \"儿童、老年人及心脏、呼吸系统疾病患者人群应减少长时间或高强度户外锻炼\",\n" +
                "        \"forecast\": [\n" +
                "            {\n" +
                "                \"date\": \"08\",\n" +
                "                \"high\": \"高温 12℃\",\n" +
                "                \"low\": \"低温 7℃\",\n" +
                "                \"ymd\": \"2024-01-08\",\n" +
                "                \"week\": \"星期一\",\n" +
                "                \"sunrise\": \"07:28\",\n" +
                "                \"sunset\": \"17:51\",\n" +
                "                \"aqi\": 87,\n" +
                "                \"fx\": \"西北风\",\n" +
                "                \"fl\": \"2级\",\n" +
                "                \"type\": \"晴\",\n" +
                "                \"notice\": \"愿你拥有比阳光明媚的心情\"\n" +
                "            },\n" +
                "            {\n" +
                "                \"date\": \"09\",\n" +
                "                \"high\": \"高温 10℃\",\n" +
                "                \"low\": \"低温 7℃\",\n" +
                "                \"ymd\": \"2024-01-09\",\n" +
                "                \"week\": \"星期二\",\n" +
                "                \"sunrise\": \"07:28\",\n" +
                "                \"sunset\": \"17:52\",\n" +
                "                \"aqi\": 55,\n" +
                "                \"fx\": \"北风\",\n" +
                "                \"fl\": \"2级\",\n" +
                "                \"type\": \"晴\",\n" +
                "                \"notice\": \"愿你拥有比阳光明媚的心情\"\n" +
                "            },\n" +
                "            {\n" +
                "                \"date\": \"10\",\n" +
                "                \"high\": \"高温 13℃\",\n" +
                "                \"low\": \"低温 8℃\",\n" +
                "                \"ymd\": \"2024-01-10\",\n" +
                "                \"week\": \"星期三\",\n" +
                "                \"sunrise\": \"07:28\",\n" +
                "                \"sunset\": \"17:53\",\n" +
                "                \"aqi\": 47,\n" +
                "                \"fx\": \"东北风\",\n" +
                "                \"fl\": \"2级\",\n" +
                "                \"type\": \"晴\",\n" +
                "                \"notice\": \"愿你拥有比阳光明媚的心情\"\n" +
                "            },\n" +
                "            {\n" +
                "                \"date\": \"11\",\n" +
                "                \"high\": \"高温 10℃\",\n" +
                "                \"low\": \"低温 6℃\",\n" +
                "                \"ymd\": \"2024-01-11\",\n" +
                "                \"week\": \"星期四\",\n" +
                "                \"sunrise\": \"07:28\",\n" +
                "                \"sunset\": \"17:53\",\n" +
                "                \"aqi\": 52,\n" +
                "                \"fx\": \"西南风\",\n" +
                "                \"fl\": \"2级\",\n" +
                "                \"type\": \"晴\",\n" +
                "                \"notice\": \"愿你拥有比阳光明媚的心情\"\n" +
                "            },\n" +
                "            {\n" +
                "                \"date\": \"12\",\n" +
                "                \"high\": \"高温 12℃\",\n" +
                "                \"low\": \"低温 6℃\",\n" +
                "                \"ymd\": \"2024-01-12\",\n" +
                "                \"week\": \"星期五\",\n" +
                "                \"sunrise\": \"07:28\",\n" +
                "                \"sunset\": \"17:54\",\n" +
                "                \"aqi\": 68,\n" +
                "                \"fx\": \"西南风\",\n" +
                "                \"fl\": \"2级\",\n" +
                "                \"type\": \"多云\",\n" +
                "                \"notice\": \"阴晴之间，谨防紫外线侵扰\"\n" +
                "            },\n" +
                "            {\n" +
                "                \"date\": \"13\",\n" +
                "                \"high\": \"高温 13℃\",\n" +
                "                \"low\": \"低温 5℃\",\n" +
                "                \"ymd\": \"2024-01-13\",\n" +
                "                \"week\": \"星期六\",\n" +
                "                \"sunrise\": \"07:28\",\n" +
                "                \"sunset\": \"17:55\",\n" +
                "                \"aqi\": 77,\n" +
                "                \"fx\": \"南风\",\n" +
                "                \"fl\": \"1级\",\n" +
                "                \"type\": \"晴\",\n" +
                "                \"notice\": \"愿你拥有比阳光明媚的心情\"\n" +
                "            },\n" +
                "            {\n" +
                "                \"date\": \"14\",\n" +
                "                \"high\": \"高温 11℃\",\n" +
                "                \"low\": \"低温 9℃\",\n" +
                "                \"ymd\": \"2024-01-14\",\n" +
                "                \"week\": \"星期日\",\n" +
                "                \"sunrise\": \"07:28\",\n" +
                "                \"sunset\": \"17:56\",\n" +
                "                \"aqi\": 68,\n" +
                "                \"fx\": \"北风\",\n" +
                "                \"fl\": \"2级\",\n" +
                "                \"type\": \"阴\",\n" +
                "                \"notice\": \"不要被阴云遮挡住好心情\"\n" +
                "            },\n" +
                "            {\n" +
                "                \"date\": \"15\",\n" +
                "                \"high\": \"高温 10℃\",\n" +
                "                \"low\": \"低温 8℃\",\n" +
                "                \"ymd\": \"2024-01-15\",\n" +
                "                \"week\": \"星期一\",\n" +
                "                \"sunrise\": \"07:27\",\n" +
                "                \"sunset\": \"17:57\",\n" +
                "                \"aqi\": 62,\n" +
                "                \"fx\": \"北风\",\n" +
                "                \"fl\": \"3级\",\n" +
                "                \"type\": \"小雨\",\n" +
                "                \"notice\": \"雨虽小，注意保暖别感冒\"\n" +
                "            },\n" +
                "            {\n" +
                "                \"date\": \"16\",\n" +
                "                \"high\": \"高温 8℃\",\n" +
                "                \"low\": \"低温 4℃\",\n" +
                "                \"ymd\": \"2024-01-16\",\n" +
                "                \"week\": \"星期二\",\n" +
                "                \"sunrise\": \"07:27\",\n" +
                "                \"sunset\": \"17:57\",\n" +
                "                \"aqi\": 61,\n" +
                "                \"fx\": \"北风\",\n" +
                "                \"fl\": \"3级\",\n" +
                "                \"type\": \"中雨\",\n" +
                "                \"notice\": \"记得随身携带雨伞哦\"\n" +
                "            },\n" +
                "            {\n" +
                "                \"date\": \"17\",\n" +
                "                \"high\": \"高温 6℃\",\n" +
                "                \"low\": \"低温 3℃\",\n" +
                "                \"ymd\": \"2024-01-17\",\n" +
                "                \"week\": \"星期三\",\n" +
                "                \"sunrise\": \"07:27\",\n" +
                "                \"sunset\": \"17:58\",\n" +
                "                \"aqi\": 66,\n" +
                "                \"fx\": \"北风\",\n" +
                "                \"fl\": \"1级\",\n" +
                "                \"type\": \"中雨\",\n" +
                "                \"notice\": \"记得随身携带雨伞哦\"\n" +
                "            },\n" +
                "            {\n" +
                "                \"date\": \"18\",\n" +
                "                \"high\": \"高温 7℃\",\n" +
                "                \"low\": \"低温 0℃\",\n" +
                "                \"ymd\": \"2024-01-18\",\n" +
                "                \"week\": \"星期四\",\n" +
                "                \"sunrise\": \"07:27\",\n" +
                "                \"sunset\": \"17:59\",\n" +
                "                \"aqi\": 54,\n" +
                "                \"fx\": \"西北风\",\n" +
                "                \"fl\": \"1级\",\n" +
                "                \"type\": \"中雨\",\n" +
                "                \"notice\": \"记得随身携带雨伞哦\"\n" +
                "            },\n" +
                "            {\n" +
                "                \"date\": \"19\",\n" +
                "                \"high\": \"高温 11℃\",\n" +
                "                \"low\": \"低温 2℃\",\n" +
                "                \"ymd\": \"2024-01-19\",\n" +
                "                \"week\": \"星期五\",\n" +
                "                \"sunrise\": \"07:27\",\n" +
                "                \"sunset\": \"18:00\",\n" +
                "                \"aqi\": 50,\n" +
                "                \"fx\": \"北风\",\n" +
                "                \"fl\": \"2级\",\n" +
                "                \"type\": \"小雨\",\n" +
                "                \"notice\": \"雨虽小，注意保暖别感冒\"\n" +
                "            },\n" +
                "            {\n" +
                "                \"date\": \"20\",\n" +
                "                \"high\": \"高温 9℃\",\n" +
                "                \"low\": \"低温 1℃\",\n" +
                "                \"ymd\": \"2024-01-20\",\n" +
                "                \"week\": \"星期六\",\n" +
                "                \"sunrise\": \"07:26\",\n" +
                "                \"sunset\": \"18:01\",\n" +
                "                \"aqi\": 47,\n" +
                "                \"fx\": \"北风\",\n" +
                "                \"fl\": \"4级\",\n" +
                "                \"type\": \"小雨\",\n" +
                "                \"notice\": \"雨虽小，注意保暖别感冒\"\n" +
                "            },\n" +
                "            {\n" +
                "                \"date\": \"21\",\n" +
                "                \"high\": \"高温 7℃\",\n" +
                "                \"low\": \"低温 0℃\",\n" +
                "                \"ymd\": \"2024-01-21\",\n" +
                "                \"week\": \"星期日\",\n" +
                "                \"sunrise\": \"07:26\",\n" +
                "                \"sunset\": \"18:02\",\n" +
                "                \"aqi\": 46,\n" +
                "                \"fx\": \"北风\",\n" +
                "                \"fl\": \"3级\",\n" +
                "                \"type\": \"小雨\",\n" +
                "                \"notice\": \"雨虽小，注意保暖别感冒\"\n" +
                "            },\n" +
                "            {\n" +
                "                \"date\": \"22\",\n" +
                "                \"high\": \"高温 8℃\",\n" +
                "                \"low\": \"低温 -1℃\",\n" +
                "                \"ymd\": \"2024-01-22\",\n" +
                "                \"week\": \"星期一\",\n" +
                "                \"sunrise\": \"07:26\",\n" +
                "                \"sunset\": \"18:02\",\n" +
                "                \"aqi\": 118,\n" +
                "                \"fx\": \"西南风\",\n" +
                "                \"fl\": \"1级\",\n" +
                "                \"type\": \"霾\",\n" +
                "                \"notice\": \"雾霾来袭，戴好口罩再出门\"\n" +
                "            }\n" +
                "        ],\n" +
                "        \"yesterday\": {\n" +
                "            \"date\": \"07\",\n" +
                "            \"high\": \"高温 12℃\",\n" +
                "            \"low\": \"低温 7℃\",\n" +
                "            \"ymd\": \"2024-01-07\",\n" +
                "            \"week\": \"星期日\",\n" +
                "            \"sunrise\": \"07:28\",\n" +
                "            \"sunset\": \"17:50\",\n" +
                "            \"aqi\": 133,\n" +
                "            \"fx\": \"北风\",\n" +
                "            \"fl\": \"2级\",\n" +
                "            \"type\": \"霾\",\n" +
                "            \"notice\": \"雾霾来袭，戴好口罩再出门\"\n" +
                "        }\n" +
                "    }\n" +
                "}";
        WeatherInfo info = JSON.parseObject(json, WeatherInfo.class);
        System.out.println(info.getCityInfo().getCity());
    }
}
